export const homeLang = {
  首页: "首页",
  零代码自动化测试平台: "零代码自动化测试平台",
  为企业提供实时测试团队协作测试提高系统正确性和用户转化:
    "为企业提供零代码自动化测试、团队协作测试, 提高系统正确性和用户转化",
  个人永久免费: "个人永久免费",
  设置简单: "设置简单",
  无需信用卡: "无需信用卡",
  文档: "文档",
  价格: "价格",
  博客: "博客",
  // Demo: {
  //   zh: "Demo",
  //   en: "Demo",
  // } as unknown as string,
  示例: "示例",
  登入: "登入",
  自动测试一行代码接入提高产品质量: "自动测试、一行代码接入、提高产品质量",
  将自动化测试功能添加到您的网站随时检测企业产品完整功能情况:
    "将自动化测试功能添加到您的网站，随时检测企业产品完整功能情况",
  点击下面播放按钮体验: "点击下面播放按钮体验",
  自动化测试: "自动化测试",
  动动鼠标完成测试: "动动鼠标,完成测试",
  通过测试环境外嵌Testflowy您可以直接在您的系统页面中进行交互录制和播放测试:
    "通过测试环境外嵌Testflowy, 您可以直接在您的系统页面中进行交互录制和播放测试",
  全用例回归: "全用例回归",
  一键回归所有测试用例每一次发版都更有信心: "一键回归所有测试用例,每一次发版都更有信心",
  用Testflowy录制测试研发提速度我们会帮您减少产品漏洞并提高缩短开发周期:
    "用 Testflowy 录制测试、研发提速度。我们会帮您减少产品漏洞并提高缩短开发周期, 减少自动化测试的编码学习成本",
  // 编排测试用例: "编排测试用例",
  // 在线管理测试用例随时随地的在各类环境中执行录制您的测试用例:
  //   "在线管理测试用例, 随时随地的在各类环境中执行、录制您的测试用例",
  团队协同测试: "团队协同测试",
  通过团队协同功能您可以很轻松的让团队各成员复用自动化测试:
    "通过团队协同功能, 您可以很轻松的让团队各成员复用自动化测试, 从而为您的企业研发效率赋能; 团队权限管理, 防止因为人员流动带来的测试资产的负面因素",
  本地密钥加密: "本地密钥加密",
  您可以选择加密用例仅有您自己的本地秘钥才知道用例的内容我们平台不会知道您的测试用例的具体内容:
    "您可以选择加密用例,仅有您自己的本地秘钥才知道用例的内容, Testflowy 平台无法知道您的测试用例的具体内容",
  立即试用Testflowy: "立即试用 Testflowy",
  为企业构建的自动化测试引导工具: "为企业构建的自动化测试、引导工具。",
};
