import { UxPrivateInfo } from "solid-ux/UxPrivateInfo";
import { routers } from "../..";
import { i18n } from "../../../i18n";

/*eslint-disable no-useless-escape*/
const text = `
隐私权政策
更新时间：2022年12月29日 生效日期：2022年12月29日 开发者：深圳格物链科技有限公司

欢迎您使用深圳格物链科技有限公司（以下简称“格物链科技”或“我们”）的产品和服务！我们深知个人信息对您的重要性，您的信任对我们非常重要，我们将根据法律法规要求并参照行业最佳实践为您的个人信息安全提供充分保障。为此，格物链科技应用服务提供者（或称“我们”）制定本《隐私权政策与用户协议》（下称“本政策”）以便您充分了解，在您使用格物链科技应用的产品和服务的过程中，我们会如何收集、使用、共享、存储和保护您的个人信息，以及您可以如何管理您的个人信息。

请你务必审慎阅读、充分理解本协议各条款内容，特别是以粗体标注的部分，包括但不限于免除或者限制责任的条款。如你不同意本服务协议及/或随时对其的修改，你应立即停止注册；你一旦使用我们提供的服务，即视为你已了解并完全同意本服务协议各项内容，包括我们对服务协议所做的修改，并成为我们的用户。

本政策主要向您说明：

【我们如何收集和使用您的个人信息】

格物链科技为您提供便捷的电子商务交易平台服务，为了实现服务的提供，我们主要会基于如下需要收集、使用、共享、存储您的个人信息：

1、注册、登录格物链科技应用账户时收集信息
2、使用格物链科技应用过程中收集信息
3、客服及争议处理：当您与我们联系或提出售中、售后、争议纠纷处理申请时，为了保障您的账户及系统安全，我们需要您提供必要的个人信息以核验您的会员身份
4、向您展示新功能或服务信息
5、发送与您使用我们的产品及/或服务相关的信息
6、安全保障：为保障您的账户及交易安全，我们需要收集和处理您的设备信息、日志信息，我们也会将这些信息用于预防发生各类违法违规或其他主体合法权益被侵害的情况
7、为向您提供更便捷、更优质的产品及/或服务，努力提升您的体验，我们在向您提供一些附加服务中可能会收集和使用您的个人信息
【您如何管理自己的信息】

您可以通过多种方式管理您的个人信息，例如编辑个人/公司资料更新您的个人/公司信息，以及注销您的账户。如果您在管理您的个人信息时遇到问题，您还可以直接联系格物链科技，我们将在15天内回复您的要求。但也请您理解，我们可能会因为履行法律法规义务或者我们提供服务必要性的原因无法完全满足您的请求。

【本政策适用范围】

请您特别注意：本政策适用于格物链科技应用服务提供者以网站、客户端、小程序以及随技术发展出现的新形态向您提供的各项产品和服务，包括但不限于易订货、易订货2.0、易销存、格物链供应链、格物链易订货、格物链易销存等软件服务。如我们及关联公司的产品或服务中使用了格物链科技应用的产品或服务（如使用格物链平台账户登录），但未设独立隐私权政策的（如格物链科技APP、格物链科技官网等），则本政策同样适用于该部分产品或服务。 除本政策说明的相关信息收集使用活动外，本政策不适用于格物链科技应用卖家及其他第三方向您提供的其他服务，其他服务适用其向您另行说明的个人信息收集使用规则。例如，当您加入卖家或品牌的会员时，则此类卖家或品牌对会员信息的使用适用其专门向您说明的规则。

本政策将帮助您了解以下内容：

一、定义及适用范围

二、我们如何收集、使用您的个人信息

三、我们如何使用Cookie和同类技术*

四、我们如何共享、转让、公开披露您的信息

五、我们如何保护您的个人信息

六、我们如何存储您的个人信息

七、您如何管理您的个人信息

八、我们如何处理未成年人的个人信息

九、本政策如何更新

十、帐号注册

十一、注册信息和隐私保护

十二、使用规则

十三、服务内容

十四、免责声明

十五、知识产权和其他合法权益

十六、联系我们

一、定义及适用范围
（一）定义

格物链科技应用：包括但不限于格物链客户为您提供的易订货、易订货2.0、易销存、格物链供应链、格物链易订货、格物链易销存等软件服务。

格物链科技应用服务提供者：指格物链科技应用的互联网信息及软件技术服务提供者深圳格物链科技有限公司。


个人信息：

指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。

个人敏感信息：

指包括身份证件号码、个人生物识别信息、银行账号、财产信息、行踪轨迹、交易信息、14岁以下（含）儿童信息等的个人信息（我们将在本政策中对具体个人敏感信息以粗体进行显著标识）。

个人信息删除：

指在实现日常业务功能所涉及的系统中去除个人信息的行为，使其保持不可被检索、访问的状态。

儿童：

指不满十四周岁的未成年人。

二、我们如何收集、使用您的信息以及您可以如何管理您的信息
在您使用我们的产品/服务时，我们需要/可能需要收集和使用的您的个人信息包括如下两种：

1、为实现向您提供我们产品及/或服务的基本功能，您须授权我们收集、使用的必要的信息。如您拒绝提供相应信息，您将无法正常使用我们的产品及/或服务；

2、为实现向您提供我们产品及/或服务的附加功能，您可选择是否授权我们收集、使用的信息。如您拒绝提供，您将无法正常使用相关附加功能或无法达到我们拟达到的功能效果。

我们在此特别提醒您：

1、我们致力于打造多样的产品和服务以满足您的需求。因我们向您提供的产品和服务种类众多，且不同用户选择使用的具体产品/服务范围存在差异，故基本/附加功能及对应收集使用的个人信息类型、范围等会有所区别，请以具体的产品/服务功能为准；

2、为给您带来更好的产品和服务体验，我们持续努力改进我们的产品、服务及技术，随之我们可能会不时推出新的或优化后的功能，可能需要收集、使用新的个人信息或变更个人信息使用目的或方式。如发生上述情形，我们将通过更新本政策、弹窗、页面提示等方式另行向您详细说明，并为您提供自主选择同意的方式，且在征得您明示同意后再开始收集、使用。在此过程中，如果您有任何疑问、意见或建议的，您可通过本政策文末联系方式与我们联系，我们会尽快为您作出解答。

为了方便您快速了解我们收集您的个人信息的情况，我们准备了个人信息收集清单。
格物链将尽全力保护用户的个人信息安全，并保障用户的个人信息处理中的权益。为向用户提供更高效、便捷的服务和体验，我们可能会收集用户在使用过程中主动授权/提供等方式产生的个人信息。其中，正式使用场景下产生的个人信息数据仅储存在用户的业务系统内，由用户自主管理；体验状态下产生的虚拟个人信息数据暂存在公共租户数据库，我们将定期清理。

1、个人基本信息
（1）手机号

使用目的：创建易订货账号；身份验证；账号识别；接收消息通知

使用场景：注册账号时；验证码登录/修改密码/找回密码/新设备登录/绑定手机号/注销账号；推送消息时

（2）姓名

使用目的：展示账号信息

使用场景：用户登录时

（3）密码

使用目的：创建账号；身份验证；管理账号

使用场景：用户注册时；密码登录/账号注销时；修改密码/找回密码时

（4）关联企业

使用目的：提供账号的关联企业；展示企业名称

使用场景：用户登录后每次启动APP时;切换企业时;注销账号时

2、个人身份信息
（1）企业信息（企业组织名称、企业营业执照信息、统一社会信用代码、法定代表人信息、企业联系人姓名、地址、联系电话、电子邮箱）

使用目的：企业认证；完善信息

使用场景：注册登录时，完善企业信息时，APP内使用不涉及

（2）个人信息（手机号码、电子邮箱地址）

使用目的：个人完善信息

使用场景：登录认证时、完善个人信息时

3、使用过程信息
（1）消息记录

使用目的：展示消息内容

使用场景：使用消息中心时

（2）单据记录

使用目的：展示单据记录、单据详情

使用场景：查看单据列表/详情时

（3）使用日志

使用目的：当使用出现问题时，搜集用户的操做行为进行故障分析

使用场景：使用过程中

（4）相机/摄像头

使用目的：扫码识别商品，上传图片等服务时需要使用相机/摄像头获取信息

使用场景：开启相机/摄像头权限后用于扫码识别商品，上传图片等服务

（5） 相册信息

使用目的：图片/视频上传服务时需要使用相册获取信息

使用场景：开启相册权限后用于进行上传图片/视频，以实现商品资料/附件的更新

（6） 麦克风语音信息

使用目的：开启麦克风实现客服通话功能

使用场景：开启麦克风权限后用仅用于用户主动点击应用内麦克风图标或录制视频时通过麦克风获取信息

（7）储存信息

使用目的：为了保障客户端的稳定运行，用于向用户提供信息发布或在本地记录崩溃日志信息等功能

使用场景：开启可读取/写入设备存储的权限后，我们将自用户设备存储空间内读取或向其中写入图片、文件、崩溃日志信息等必要信息

4、位置信息
（1）位置信息

使用目的：帮助定位位置；使用导航功能；定位并连接附近蓝牙打印设备

使用场景：录入地址；开启导航时；使用蓝牙打印功能时

5、设备信息
（1）IMEI

使用目的：用于识别设备，进行消息推送和安全保障

使用场景：登录APP时，消息推送时

（2）IDFA

使用目的：用于识别设备，进行消息推送和错误日志

使用场景：登录APP时；推送消息时

（3）硬件型号

使用目的：用于识别设别，进行消息推送和安全保障

使用场景：登录APP时；推送消息时

（4）系统版本

使用目的：用于识别设别，进行消息推送和安全保障

使用场景：登录APP时；推送消息时

（5）Android ID

使用目的：用于识别设备，进行消息推送和安全保障

使用场景：登录APP时；推送消息时

（6）网络信息

使用目的：用于识别设备，进行消息推送和安全保障

使用场景：登录APP时;推送消息时

（7）系统应用进程

使用目的：用于消息推送

使用场景：登录APP时

我们会为您提供的各项具体功能场景包括：
（一）注册、登录格物链科技账户时收集信息
在使用我们的产品及/或服务之前，您需要获取格物链科技应用账户。在注册时，您需要向我们提供您所在的公司名称，您的姓名、手机号码。

（二）使用格物链科技应用过程中收集信息。
（1）设备信息

我们会根据您在手机端安装及使用格物链科技 APP时授予的具体权限，接收并记录您所使用的设备相关信息（包括设备型号、操作系统版本、软件安装列表、设备设置、唯一设备标识符在内的软硬件特征信息）、设备所在位置相关信息（包括GPS/北斗位置信息）。您使用网页客户端或桌面应用程序登录格物链科技系统的，我们将收集您所使用设备的User Agent（包括操作系统类型、操作系统版本、浏览器版本），以便我们判断您使用格物链科技产品的系统兼容性和进行故障分析。

（2）日志信息

当您使用格物链科技产品或服务时，我们会收集您对我们服务的详细使用情况作为有关网络日志保存，包括您的搜索查询内容、IP地址、浏览器的类型、访问的日期和时间、您访问的网页记录在内的工作日志信息；当您的使用出现故障时，我们将收集您的浏览及操作行为以便我们进行故障分析。

（三）客服及争议处理
当您与我们联系或提出售中、售后、争议纠纷处理申请时，为了保障您的账户及系统安全，我们需要您提供必要的个人信息以核验您的会员身份。

为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果，我们可能会保存您与我们的沟通、通信/通话记录及相关内容（包括账户信息、订单信息、您为了证明相关事实提供的其他信息，或您留下的联系方式信息），如果您针对具体订单进行咨询、投诉或提供建议的，我们会使用您的账户信息和订单信息。

为了提供服务及改进服务质量的合理需要，我们还可能使用的您的其他信息，包括您与客服联系时您提供的相关信息，您参与问卷调查时向我们发送的问卷答复信息。

（四）向您展示新功能或服务信息
为了向您展示更契合您及/或您所在企业用户需求的格物链科技产品功能或服务信息，也为了让您及/或您所在企业用户了解您可能格物链科技产品的新功能或更新的功能及相应的服务，我们会收集和使用您使用格物链科技产品时的使用信息、设备信息或使用日志以形成群体特征标签，用于向用户提供新功能上线通知信息或推送其他信息。

（五）发送与您使用我们的产品及/或服务相关的信息
在您所在企业订购格物链科技产品后，若您作为所在企业用户的指定联系人，我们可能会需要使用您的邮箱、手机号码向您发送与我们的产品及/或服务相关的并会影响到您或您所在企业用户权益的信息，例如提醒您格物链科技产品的开通、产品功能更新、软件剩余使用时间等，但这并不影响您拒绝接收我们向您发送商业信息的权利。

（六）为您提供安全保障
为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或格物链科技应用相关协议、规则的情况，我们在应用程序中嵌入我们关联公司开发的应用安全SDK收集您的设备信息、服务日志信息，并可能使用或整合您的会员信息、交易信息、设备信息、服务日志信息以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。

经你授权我们会收集你的设备信息（包括设备属性、设备型号、设备标识符「如IMEI/androidID/IDFA/OPENUDID/GUID/OAID、SIM卡IMSI、ICCID信息」、设备MAC地址）对格物链风控问题进行分析、统计流量并排查可能存在的风险，在你选择向我们发送异常信息时予以排查。

（七）为您提供的其他附加服务
为向您提供更便捷、更优质的产品及/或服务，努力提升您的体验，我们在向您提供的以下附加服务中可能会收集和使用您的个人信息。如果您不提供这些信息，不会影响您使用格物链科技应用的浏览、搜索、购买等基本服务，但您可能无法获得这些附加服务给您带来的用户体验。这些附加服务包括：

1、基于位置信息的附加服务：我们会在您开启位置权限后访问获取您的位置信息，您可以使用此权限用户添加/获取客户地址定位

2、基于相机/摄像头的附加服务：您可在开启相机/摄像头权限后使用该功能进行扫码用于扫码识别商品，上传商品图片等服务，即使您已同意开启相机/摄像头权限，我们也仅会在您主动拍摄、录制、扫码等使用相机/摄像头时获取信息。

3、基于相册（图片库/视频库）的图片/视频访问及上传的附加服务：您可在开启相册权限后使用该功能上传您的照片/图片/视频，以实现商品资料/订单附件的更新。

4、基于麦克风的语音技术相关附加服务：您可在开启麦克风权限后使用麦克风实现客服通话功能，即使您已同意开启麦克风权限，我们也仅会在您主动点击客户端内麦克风图标或录制视频时通过麦克风获取语音信息。

5、基于存储权限的附加服务：我们向您申请获取此权限，目的是为了保障客户端的稳定运行。在您开启我们可读取/写入您设备存储的权限后，我们将自您设备存储空间内读取或向其中写入图片、文件、崩溃日志信息等必要信息，用于向您提供信息发布或在本地记录崩溃日志信息等功能。

6、基于二维码保存的附加服务：我们读取您的二维码保存权限是为了便于您使用APP进行二维码收款等服务。

7、基于蓝牙打印的附加服务：我们读取您的蓝牙打印权限是为了便于您使用APP连接蓝牙打印机进行订单打印等功能。

8、基于手机APP消息推送的服务：我们将获取您APP的消息推送和手机唤醒权限，用户向您推送重要的业务通知。

9、基于手机电话权限的服务：我们将获取您的手机电话拨打权限，您可以使用APP进行客服热线拨打。

10、基于开机自启动的扩展说明：我们将在您开机时通过后台自启动并查收您在本APP中的离线消息（即您的待办业务消息）。我们自启动仅用于确认您是否有最新的待办业务，以免您错过待处理工作，并不会在前台打开本APP或运行其他功能。

11、基于手机APP信息的拓展功能

您理解并同意，上述附加服务可能需要您在您的设备中开启您的位置信息 （地理位置）、摄像头（相机）、相册（图片库）、麦克风（语音）、通讯录、日历及/或电话状态的访问权限，以实现这些权限所涉及信息的收集和使用。您可在您的设备设置中逐项查看上述权限的状态，并可自行决定这些权限随时的开启或关闭。请您注意，您开启任一权限即代表您授权我们可以收集和使用相关个人信息来为您提供对应服务，您一旦关闭任一权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关个人信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的信息收集及使用。

你可以选择开启设备的设备信息权限。经你授权，我们会收集你的设备信息（包括设备属性、设备型号、设备标识符「如IMEI\androidID\IDFA\OPENUDID\GUID\OAID、SIM卡IMSI、ICCID信息」、设备MAC地址），对风控问题进行分析、流量统计并排查可能存在的风险，在你选择向我们发送异常信息时予以排查。此项权限你可以在系统权限中关闭，一旦关闭我们将无法保障你的帐号风险，但不会影响你享受格物链服务基本功能。

为确保相关业务功能的正常实现，我们需要根据具体的使用场景调用对应的必要权限，并在调用前向你弹窗询问。

具体的权限调用说明请查看下方权限列表：

a. 位置权限

权限用途：定位（通过网络或者卫星对你的设备定位）

使用目的：帮助你创建店铺时快速定位店铺所在位置

询问场景：选择店铺地址时；选择收货地址时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

b. 相机权限

权限用途：相机（拍摄照片和录制视频）

使用目的：帮助你用于头像修改，商品图片拍摄，实名认证服务

询问场景：修改头像时；上传商品图片时；更换店铺图片时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

c. 相册/照片权限

权限用途：访问相册/照

使用目的：用于一些内容的本地存储（如访问相册，图片保存）

询问场景：场景涉及到使用相机拍摄时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

d. 麦克风权限

权限用途：录音

使用目的：帮助你录制语音信息发送给客户

询问场景：语音制单时候；发送信息给客户或商家时；视频课程与教师互动时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

e. 蓝牙权限

权限用途：连接蓝牙

使用目的：帮助你通过蓝牙连接打印机等硬件设备

询问场景：连接蓝牙打印机时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

f. 存储权限

权限用途：读写手机存储（读写设备上的照片和文件）

使用目的：用于一些内容的本地存储（如访问相册，图片保存

询问场景：安卓访问本地本地图片或写入内容时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

g. 读取电话状态权限

权限用途：获取手机信息（获MAC地址、IMEI、IMSI）

使用目的：数据统计，推送

询问场景：拨打订单收货人电话、客服电话时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

h. 悬浮窗权限

权限用途：使用悬浮窗权限

使用目的：以展示消息通知及系统状态，以便正常使用离线收银或副屏等功能

询问场景：需通知展示时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

i. 拨打电话权限

权限用途：给客户打电话

使用目的：用与管理客户时，给客户拨打打电话

询问场景：当商家需要给客户打电话时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

j. 通知权限

权限用途：消息通知

使用目的：发送消息

询问场景：iOS系统需要发起通知时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

k. IDFA （iOS14及以上）

权限用途：设备追踪

使用目的：用于追踪应用市场广告投放效果

询问场景：首次打开客户端时

使用平台：安卓/IOS

是否询问：是

是否可以关闭：是

（八）收集和使用个人信息的其他规则
1、若您提供的信息中含有其他用户的个人信息，在向格物链科技应用提供这些个人信息之前，您需确保您已经取得合法的授权。

2、若我们将信息用于本政策未载明的其他用途，或者将基于特定目的收集而来的信息用于其他目的，均会事先获得您的同意。

3、若我们从第三方处间接获取您的信息，我们会在收集前明确以书面形式要求该第三方说明其个人信息来源，以及是否已经就其收集、处理以及向我们提供您的个人信息取得了您的合法授权。除法律明确允许的情形外，我们只会在确认第三方已经取得您的授权同意后再从第三方收集您的个人信息，如果第三方的授权范围无法涵盖我们的处理和使用目的时，我们会自行或者要求该第三方征得您的同意后再行处理您的个人信息。同时，我们的专业安全团队对个人信息会进行安全加固（包括敏感信息报备、敏感信息加密存储、访问权限控制等）。我们会使用不低于我们对自身用户个人信息同等的保护手段与措施对间接获取的个人信息进行保护。

4、征得授权同意的例外

根据相关法律法规规定，我们在以下情况下收集、使用您的个人信息无需您的授权同意：

（1）与我们履行法律、法规规定的义务相关的；

（2）与国家安全、国防安全直接相关的；

（3）与公共安全、公共卫生、重大公共利益直接相关的；

（4）与犯罪侦查、起诉、审判和判决执行等司法或行政执法直接相关的；

（5）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；

（6）您自行向社会公众公开的个人信息；

（7）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；

（8）根据与您签订和履行相关协议或其他书面文件所必需的；

（9）用于维护所提供的产品及/或服务的安全稳定运行所必需的，例如发现、处置产品及/或服务的故障；

（10）法律法规规定的其他情形。

请知悉，根据适用的法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，或我们可能会对收集的信息进行去标识化地研究、统计分析和预测，用于改善格物链科技应用的内容和布局，为商业决策提供产品或服务支撑，以及改进我们的产品和服务（包括使用匿名数据进行机器学习或模型算法训练），则此类处理后数据的使用无需另行向您通知并征得您的同意。

5、如我们停止运营格物链科技应用产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对我们所持有的与已关停业务相关的个人信息进行删除或匿名化处理。涉及儿童个人信息的，我们会并将停止运营的通知及时告知儿童监护人。

三、我们如何使用 Cookie 和同类技术
（一）Cookie的使用
为确保网站正常运转、为您获得更轻松的访问体验，我们会在您的计算机或移动设备上存储Cookie、Flash Cookie，或浏览器（或关联应用程序）提供的其他通常包含标识符、站点名称以及一些号码和字符的本地存储（统称“Cookie”）。借助于 Cookie，网站能够存储您的偏好或页面缓存数据。

如果您的浏览器或浏览器附加服务允许，您可修改对Cookie的接受程度或拒绝我们的Cookie。有关详情，请参见 AboutCookies.org。但如果您执行本条所述操作，在某些情况下可能会影响您安全访问我们的网站，且可能需要在您每一次访问我们的网站时更改用户设置。

（二）Cookie同类技术的使用
除 Cookie 外，我们还会在网站上使用网站信标、像素标签等其他同类技术。

例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好，以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。

（三）SDK的使用
为保障我们客户端的稳定运行、功能实现，使您能够享受和使用更多的服务及功能，我们的应用中会嵌入授权合作伙伴的SDK或其他类似的应用程序，合作SDK可能需要收集您的ANDROID ID以提供统计分析服务，并通过应用启动数据及异常错误日志分析改进性能和用户体验，为用户提供更好的服务。

我们会对授权合作伙伴获取有关信息的应用程序接口（API）、软件工具开发包（SDK）进行严格的安全检测，并与授权合作伙伴约定严格的数据保护措施，令其按照本政策以及其他任何相关的保密和安全措施来处理个人信息。

关于我们接入的合作伙伴等13个第三方SDK目录如下：

（1）Bugly

公司名称：深圳市腾讯计算机系统有限公司

个人信息种类：MAC地址

使用目的：异常上报

使用场景：APP异常中断闪退时上报异常数据提供开发人员进行分析处理

共享方式：SDK接口传输

隐私政策：https://static.bugly.qq.com/bugly-sdk-privacy-statement.pdf

（2） 微信SDK

公司名称：深圳市腾讯计算机系统有限公司

个人信息种类：设备标识信息（BSSID/（沿备序列号/IME/MAC地址/SSID/IMSI）、位置信息、Wi-Fi地址、运营商信息、应用列表

使用目的：微信登录

使用场景：支持微信授权登录、微信分享和微信支付

共享方式：SDK本机采集

隐私政策：https://open.weixin.qq.com/cgi-bin/frame?t=news/protocol_developer_tmpl

（3）个推消息推送SDK

公司名称：浙江每日互动网络科技股份有限公司

个人信息种类：设备标识信息（BSSID/设备序列号/IMEI/MAC地址/SSID/BSSID/设备序列号（BSSID/IMEI/MAC地址/SSID/IMSI）、设备平台（设备厂商、设备品牌、设备识别码）应用列表信息、网络信息、位置信息、安装列表

使用目的：消息推送

使用场景：推送消息

共享方式：SDK本机采集

隐私政策：https://www.getui.com/privacy

（4） 阿里云一键登录

公司名称：阿里云阿里云计算有限公司

个人信息种类：设备标识信息（BSSID/设备序列号/IMEI/MAC地址/SSID/IMSI）、手机号码

使用目的：阿里云一键登录

使用场景：阿里云一键登录

共享方式：SDK本机采集

隐私政策：https://help.aliyun.com/document_detail/144231.html?spm=a2c4g.11186623.6.572.56976a26LkKBCl

（5）友盟SDK

公司名称：友盟同欣（北京）科技有限公司

个人信息种类：设备标识信息（BSSID/设备序列号/IMEI/MAC地址/SSID/BSSID/设E/MEI/MAC地址/SSID/IMSI）、设备平台（设备厂商、设备品牌、设备识别码）应用列表信息、网络信息、位置信息、安装列表

使用目的：用户行为数据统计

使用场景：用户使用APP过程中使用

共享方式：SDK本机采集

隐私政策：https://www.umeng.com/policy

（6） 腾讯位置 SDK

公司名称：深圳市腾讯计算机系统有限公司

个人信息种类：网络类型、设备型号、手机屏幕密度/尺寸、操作系统及版本、IP地址、OAID

使用目的：帮助用户定位位置、查看位置/拜访轨迹

使用场景：用户获取正式客户的公司和联系人地址、使用导航功能、查看客户拜访轨迹、跟进任务使用地图模式查看、获取潜客的公司和联系人地址时使用

共享方式：SDK本机采集

隐私政策：https://privacy.qq.com/document/preview

（7）华为推送

公司名称：华为软件技术有限公司

个人信息种类：应用基本信息、应用内设备标识符、设备的硬件信息、系统基本信息和系统设置信息

使用目的：1、提供消息推送服务;2、统计华为推送SDK接口调用成功率

使用场景：新消息到达设备时提醒用户查看

共享方式：SDK本机采集

隐私政策：https://developer.huawei.com/consumer/cn/

（8）小米推送（android专有）

公司名称：小米移动软件有限公司

个人信息种类：设备标识信息（OAID、加密的AndroidID、应用包名、版本号和运行状态）消息内容、消息创建、送达和点击时间设备信息（设备厂商、设备型号、设备内存、操作系统版本、小米推送SDK版本、设备归属地（国家或地区）、SIM卡运营商名称、当前网络类型）。其中当前网络类型、SIM卡运营商名称仅在设备本地读取，不会上传至小米服务器。

使用目的：向小米设备用户推送消息

使用场景：新消息到达设备时提醒用户查看

共享方式：SDK本机采集

隐私政策：https://dev.mi.com/console/doc/detail?pld=

（9）OPPO推送（安卓专有）

公司名称：广东欢太科技有限公司

个人信息种类：设备相关信息（如IMEI号、SerialNumber、IMSI、UserID、AndroidID、GoogleAdvertisingID、手机区域设置、设备型号、手机电量、手机操作系统版本及语言等）、使用推送服务的应用信息、推送SDK版本号、网络相关信息、消息发送结果

使用目的：向设备推送消息

使用场景：新消息到达设备时提醒用户查看

共享方式：SDK本机采集

隐私政策：https://open.oppomobile.com/wiki/doc#id=10288

（10）VIVO推送（安卓专有）

公司名称：维沃移动通信有限公司

个人信息种类：设备标识信息（如IMEI号）、手机型号、系统类型、系统版本

使用目的：向设备推送消息

使用场景：新消息到达设备时提醒用户查看

共享方式：SDK本机采集

隐私政策：https://www.vivo.com.cn/about-vivo/privacy-policy

（11） 魅族推送（android专有）

公司名称：珠海市魅族通讯设备优先公司

个人信息种类：设备标识信息（如IMEI号）、手机型号、系统类型、系统版本

使用目的：向设备推送消息

使用场景：新消息到达设备时提醒用户查看

共享方式：SDK本机采集

隐私政策：https://www.meizu.com/legal.html

（12）360奇虎SDK

公司名称：北京奇虎科技有限公司

个人信息种类：设备标识信息（BSSID/设备序列号/\MEI/MAC地址/SSID/BSSID/设备序列号/IMEI/MAC地址/SSID/IMSI）、设备平台（设备厂商、设备品牌、设备识别码）应用列表信息、网络信息、位置信息、安装列表列表

使用目的：安全

使用场景：用户使用APP过程中使用

共享方式：SDK本机采集

隐私政策：https://dev.360.cn/wiki/index/id/16

（13） 神策分析

公司名称：神策网络科技（北京）有限公司

个人信息种类：网络类型、IMEI、MAC地址、ANDROID_ID、WIFI信息、IDFA、IDFV、应用进程信息、IP地址

使用目的：用户行为数据统计

使用场景：用户使用APP过程中

共享方式：SDK本机采集

隐私政策：https://manual.sensorsdata.cn/sa/latest/%E9%9A%90%E7%A7%81%E6%94%BF%E7%AD%96-87163323.html

（14） 支付宝SDK

公司名称：支付宝（中国）网络技术有限公司

个人信息种类：设备标识符（imsi、imei、MAC地址、AndroidID、SSID、BSSID、OAID、UDID）、通讯录权限、剪切板信息、应用安装列表、日历信息、位置信息、IP或网关地址、摄像头或麦克风权限、读取外部存储目录、读取通话记录权限、拨号权限、WI-FI信息、设备登录的账号信息、短信权限

使用目的：为使用钱包、完成订单支付；使用支付宝服务

使用场景：订单支付

共享方式：SDK本机采集

隐私政策：https://render.alipay.com/p/yuyan/180020010001196791/preview.html?agreementId=AG00000132

（15） 腾讯地图SDK

公司名称：深圳市腾讯计算机系统有限公司

个人信息种类：设备标识信息(如OAID、IMEI号、MAC地址、AndroidID、IDFA）、GPS地理位置信息数据传输方式：客户端接口传输，服务端传输

使用目的：提供定位功能服务

使用场景：使用地图、导航等定位功能

共享方式：SDK本机采集

隐私政策：https://privacy.qq.com/document/preview/a10a8634f237464da9a95f4f07e73e40

（16） 腾讯 tbs SDK

公司名称：深圳市腾讯计算机系统有限公司

个人信息种类：获取运行中的进程、设备IMEI、设备IMSI、MAC地址、网络状态

使用目的：提供APP内浏览网页服务

使用场景：APP内打开网页链接

共享方式：SDK本机采集

隐私政策：https://x5.tencent.com/docs/privacy.html

四、我们如何共享、转让、公开披露您的信息
（一）共享
我们不会与格物链科技应用服务提供者以外的公司、组织和个人共享您的个人信息，但以下情况除外：

1、在法定情形下的共享：我们可能会根据法律法规规定、诉讼、争议解决需要，或按行政、司法机关依法提出的要求，对外共享您的个人信息。

2、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的个人信息。

3、为您提供您需要的产品或服务必要的情况下共享：您通过格物链科技应用购买商品或服务，我们会根据您的选择，将您的订单信息中与交易有关的必要信息共享给相关商品或服务的提供者，以实现您的交易、配送及售后服务需求。

4、与关联公司间共享：为便于我们基于格物链科技应用账户向您提供产品和服务，保护格物链科技应用关联公司或其他用户或公众的人身财产安全免遭侵害，您的个人信息可能会与我们的关联公司和/或其指定的服务提供商共享。我们只会共享必要的个人信息，且受本政策中所声明目的的约束，如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。

5、与授权合作伙伴共享：我们可能委托授权合作伙伴为您提供某些服务或代表我们履行职能，我们仅会出于本政策声明的合法、正当、必要、特定、明确的目的共享您的信息，授权合作伙伴只能接触到其履行职责所需信息，且我们将会通过协议要求其不得将此信息用于其他任何目的。

目前，我们的授权合作伙伴包括以下类型：

（1）广告、分析服务类的授权合作伙伴。我们会委托这些合作伙伴处理与广告覆盖面和有效性相关的信息，但除非得到您的许可，否则我们不会将您的个人身份信息与提供广告、分析服务的合作伙伴共享，或者我们会将这些信息进行去标识化处理，以便授权合作伙伴无法识别您个人。这类合作伙伴可能将上述信息与他们合法获取的其他数据相结合，以执行我们委托的广告服务或决策建议。

（2）供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括受我们委托提供的技术基础设施服务、分析我们服务的使用方式、提供客户服务、支付便利或进行学术研究和调查。

您可点击此处查看格物链科技应用数据共享情况说明。

（二）转让
我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：

1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；

2、在格物链科技应用服务提供者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。

（三）公开披露
我们仅会在以下情况下，公开披露您的个人信息：

1、获得您明确同意或基于您的主动选择，我们可能会公开披露您的个人信息；

2、如果我们确定您出现违反法律法规或严重违反格物链科技应用相关协议及规则的情况，或为保护格物链科技应用用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或征得您同意的情况下披露关于您的个人信息，包括相关违规行为以及格物链科技应用已对您采取的措施。例如，若您因出售假冒商品而严重违反淘宝规则，我们可能会公开披露您的店铺认证主体信息与违规情况。

（四）共享、转让、公开披露个人信息时事先征得授权同意的例外
根据相关法律法规规定，以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：

1、与我们履行法律法规规定的义务相关的；

2、与国家安全、国防安全直接相关的；

3、与公共安全、公共卫生、重大公共利益直接想关的；

4、与犯罪侦查、起诉、审判和判决执行等司法或行政执法直接相关的；

5、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；

6、您自行向社会公众公开的个人信息；

7、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。

请知悉，根据适用的法律，若我们对个人信息采取技术措施和其他必要措施进行处理，使得数据接收方无法重新识别特定个人且不能复原，则此类处理后数据的共享、转让、公开披露无需另行向您通知并征得您的同意。

五、我们如何保护您的信息
（一）我们采取的数据保护技术措施
我们已采取符合业界标准、合理可行的安全防护措施保护您的信息，防止个人信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。例如，我们会使用加密技术提高个人信息的安全性，在您的浏览器与服务器之间交换数据时受 SSL协议加密保护，我们同时对格物链科技应用网站提供HTTPS协议安全浏览方式；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息。目前，我们的重要信息系统已经通过网络安全等级保护的三级以上测评。

（二）我们采取的数据保护管理组织措施
我们建立了行业内先进的以数据为核心、围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等方面多维度提升个人信息的安全性。我们已经设置了个人信息保护专职部门，并指定了专人负责儿童个人信息保护。我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。我们将不定期更新并公开安全风险、个人信息安全影响评估报告等有关内容，您可通过格物链科技应用公告方式获得。

（三）个人信息安全事件的响应
如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损的，我们会及时启动应急预案，采取合理救济措施，以尽可能降低对您个人信息和其他权益的影响。如发生个人信息安全事件，我们还将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。

（四）账户安全风险的自主防范
我们强烈建议您在使用格物链科技应用服务时不要使用非格物链科技应用推荐的通信方式发送您的信息，同时请您使用复杂密码，协助我们保护您的账户安全。

在使用格物链科技应用服务进行网上交易时，您不可避免地要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或联系地址。此外，您也可以通过我们的服务与第三方建立沟通、交流信息或分析内容。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。如您发现自己的个人信息尤其是您的账户或密码发生泄露，请您立即联络格物链科技应用客服或格物链科技应用服务中心以便我们根据您的申请采取相应措施。

请注意，您在使用我们服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。

六、我们如何存储您的信息
（一）存储地点
我们在中华人民共和国境内运营中收集和产生的个人信息，将存储在中国境内。以下情形下，我们会在履行了法律规定的义务后，向境外实体提供您的个人信息：

1、适用的法律有明确规定；

2、获得您的明确授权；

3、您通过互联网进行跨境交易等个人主动行为。

针对以上情形，我们会通过合同等形式确保以不低于本政策规定的程度保护您的个人信息。

（二）存储期限
我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非法律有强制的留存要求，例如《中华人民共和国电子商务法》要求商品和服务信息、交易信息保存时间自交易完成之日起不少于三年。我们判断个人信息的存储期限主要参考以下标准并以其中较长者为准：

1、完成与您相关的交易目的、维护相应交易及业务记录，以应对您可能的查询或投诉；

2、保证我们为您提供服务的安全和质量；

3、您是否同意更长的留存期间；

4、是否存在关于保留期限的其他特别约定或法律法规规定。

在超出保留期间后，我们会根据适用法律的要求删除您的个人信息，或使其匿名化处理。

七、您如何管理您的信息
您除了可以按照本政策第二节中的操作路径在我们的客户端上自行操作以外，您还可以通过以下方式访问及管理您的信息：

（一）查询、更正和补充您的信息
您有权查询、更正或补充您的信息。您可以通过以下方式自行进行：

登录格物链科技应用，点击个人账户设置后查询、更正个人资料及个人账户相关信息；

（二）删除您的信息
您可以通过“（一）查询、更正和补充您的信息”中列明的方式删除您的部分信息。

在以下情形中，您可以通过与格物链科技应用客服或格物链科技应用服务中心联系向我们提出删除个人信息的请求：

1、如果我们处理个人信息的行为违反法律法规；

2、如果我们收集、使用您的个人信息，却未征得您的明确同意；

3、如果我们处理个人信息的行为严重违反了与您的约定；

4、如果您主动注销了账户。

若我们决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，并要求其及时删除（除非法律法规另有规定，或这些主体已独立获得您的授权）。

当您或我们协助您删除相关信息后，因为适用的法律和安全技术限制，我们可能无法立即从备份系统中删除相应的信息，我们将安全地存储您的个人信息并限制对其的任何进一步的处理，直到备份可以清除或实现匿名化。

（三）注销您的账户
您可以通过以下方式申请注销您的账户：

登录格物链科技应用并选择联系客服，协助您申请注销您的账户。

在您主动注销账户之后，我们将停止为您提供产品或服务，并根据适用法律的要求删除您的个人信息，或对其进行匿名化处理。

（四）响应您的上述请求
为保障您的账户安全，您向我们提出上述请求时，我们可能会先要求您验证您的身份（如要求您提供书面请求或其他方式），然后再处理您的请求。

对于您向我们提出的上述请求，我们将在【15】天内做出答复。如您不满意我们的答复，还可以通过格物链科技应用客服或格物链科技应用服务中心或直接向我们的个人信息保护专职部门发起投诉。

对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将酌情收取一定费用。对于与您的身份不直接关联的信息、无合理理由重复申请的信息，或者需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者不切实际的请求，我们可能会予以拒绝。

在以下情形中，按照法律法规要求，我们将无法响应您的请求：

1、与我们履行法律法规规定的义务相关的；

2、与国家安全、国防安全直接相关的；

3、与公共安全、公共卫生、重大公共利益直接相关的；

4、与刑事犯罪侦查、起诉、审判和执行判决等直接相关的；

5、有充分证据表明个人信息主体存在主观恶意或滥用权利的；

6、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；

7、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；

8、涉及商业秘密的。

八、我们如何处理未成年人的信息
本政策所指的儿童是指不满14周岁的个人，如果没有父母或监护人的同意，儿童不得创建自己的用户账户。如你为未成年人的，建议你请你的父母或监护人仔细阅读本隐私政策，并在征得你的父母或监护人同意的前提下使用我们的服务或向我们提供信息。

对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。

若您是儿童的父母或其他监护人，请您关注您监护的儿童是否是在取得您的授权同意之后使用我们的服务的。如您对您所监护的儿童的个人信息有疑问，请通过政策中的联系方式与我们联系。

九、本政策如何更新
我们的服务以及技术不断跟随您以及其他的用户的需求更新和优化，因此在新的服务及业务流程变更时，我们可能会更新我们的隐私权政策以告知您具体的变化。但未经您明确同意，我们不会限制您按照本政策所应享有的权利。我们会在专门页面上发布对本政策所做的任何变更。

对于重大变更，我们还会提供更为显著的通知（包括我们会通过格物链科技应用公示的方式进行通知或向您提供弹窗提示）。

本政策所指的重大变更包括但不限于：

1、我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；

2、我们在控制权等方面发生重大变化。如并购重组等引起的信息控制者变更等；

3、个人信息共享、转让或公开披露的主要对象发生变化；

4、您拥有的个人信息处理方面的权利及其行使方式发生重大变化；

5、我们负责处理个人信息保护的责任部门、联络方式及投诉渠道发生变化；

我们还会将本政策的旧版本在格物链科技应用专门页面存档，供您查阅。

十、帐号注册
1、当你注册成功帐号并且与某个格物链科技提供技术支持的店铺发生行为关联时（包括不限于获得店铺优惠券、登录商家店铺后台、产生购买行为），你授权该商家获得你的手机帐号以方便下单购买。

2、当你选择通过第三方授权登录程序进入格物链科技，你需授权格物链科技收集你的帐号昵称及头像等标识化的个人信息，授权完成后，你即成为格物链科技的“用户”。当你按照注册页面提示填写信息并注册成功后，你即成为格物链科技的“用户”；格物链科技将给予你一个用户帐号，密码由你自行设置。该用户帐号和密码由你自行负责保管。你应当对你在格物链科技进行的活动和事件负法律责任。

3、本协议服务条款和公告可由格物链科技定时更新，并按照法定流程进行公示。你在使用相关服务时,应关注并遵守其所适用的相关条款。

4、使用同一身份认证信息、同一手机号或经格物链科技排查认定多个格物链科技账户的实际控制人为同一人的，均视为同一用户。

5、你确认，在你开始使用本服务前，你应当具备中华人民共和国法律规定的与你行为相适应的民事行为能力。若你不具备前述与你行为相适应的民事行为能力，则你需要在你监护人的陪同下完成注册，并且你与你的监护人应依照法律规定承担因此而导致的一切后果。

十一、注册信息和隐私保护
1、你帐号的所有权归格物链科技，使用权归你。你按注册页面引导填写信息，阅读并同意本协议且完成全部注册程序后，即可获得注册帐号并成为用户。你应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。如果因注册信息不真实或更新不及时而引发的相关问题，由你自行承担相应的责任。

2、你应当通过真实身份信息认证注册帐号，且你提交的帐号名称、头像、 简介等注册信息中不得出现违法和不良信息，经公司审核，如存在上述情况，格物链科技将不予注册；同时，在注册后，如发现你以虚假信息骗取帐号名称注册，或其帐号头像、简介等注册信息存在违法和不良信息的，格物链科技有权不经通知单方采取限期改正、暂停使用、注销登记、收回等措施。

3、你帐号包括帐户名称和密码，账户名称作为你有效的身份凭证之一。你可使用手机号和密码登录。

4、你不应将其帐号、密码转让、出售或出借予他人使用，若你授权他人使用帐户，应对被授权人在该帐户下发生所有行为负全部责任。由于你其他账户使用信息，仅当依法律法规、司法裁定或经格物链科技同意，并符合格物链科技规定的用户帐号转让流程的情况下，方可进行帐号的转让。

5、因你个人原因导致的帐号信息遗失，如需找回帐号信息，请按照帐号找回要求提供相应的信息，并确保提供的信息合法真实有效，若提供的信息不符合要求，无法通过安全验证，格物链科技有权拒绝提供帐号找回服务；若帐号的唯一凭证不再有效，格物链科技有权拒绝支持帐号找回。例如手机号二次出售，格物链科技可拒绝支持帮助找回原手机号绑定的帐号。

6、在需要终止使用帐号服务时，符合以下条件的，你可以申请注销你的帐号：

（1）你仅能申请注销你本人的账号，请按如下路径操作：我的-设置-账号安全-注销账号；

（2）你仍应对你在注销帐号前且使用的行为承担相应责任，同时格物链科技仍可保存你注销前的相关信息；

（3）注销成功后，帐号信息、个人身份信息、交易记录、会员权益等将无法恢复或提供。

7、当你使用格物链科技产品进行支付、登录等操作的时候，服务器会自动接收、验证、并记录一些必要的信息，如手机号码、IP地址、服务访问异常信息、以及部分设备信息等，以保障你在使用服务时账户登录和支付过程的安全，进而保护你的上网安全。你使用格物链科技的服务，即表示你同意格物链科技可以按照《隐私政策》处理你的个人信息。在信息为该项产品/服务所必须的情况下，你同意格物链科技可与其分享必要的信息。并且，格物链科技会要求其确保数据安全并且禁止用于任何其他用途。除此之外，格物链科技不会向任何无关第三方提供或分享信息。

8、你知悉并授权，格物链科技仅在必需的情况下使用或与关联公司同步你的信息，以为你提供更好的服务。

9、为更好地向你提供服务，你同意格物链科技通过电话、短信、app通知等形式向你传达相关商业性服务信息。

十二、使用规则
1、你确认，当你注册使用格物链科技提供的产品时等，你确认并授权格物链科技提供技术支持获得你的手机号，以方便你的登录和购买。

2、你在使用格物链科技的服务时，必须遵守中华人民共和国相关法律法规的规定，你应同意将不会利用本服务进行任何违法或不正当的活动，包括但不限于下列行为:

（1）你设置的账户名称或提供的信息不得含有下列内容之一的信息：

① 反对宪法所确定的基本原则的；

② 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；

③ 损害国家荣誉和利益的；

④ 煽动民族仇恨、民族歧视、破坏民族团结的；

⑤ 破坏国家宗教政策，宣扬邪教和封建迷信的；

⑥ 散布谣言，扰乱社会秩序，破坏社会稳定的；

⑦ 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；

⑧ 侮辱或者诽谤他人，侵害他人合法权利的；

⑨ 含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；

⑩ 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；

（2）不得为任何非法目的而使用格物链科技服务系统；

（3）不利用格物链科技的服务从事以下活动：

① 未经允许，进入计算机信息网络或者使用计算机信息网络资源的；

② 未经允许，对计算机信息网络功能进行删除、修改或者增加的；

③ 未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；

④ 故意制作、传播计算机病毒等破坏性程序的；

⑤ 其他危害计算机信息网络安全的行为。

3、你违反本协议或相关的服务条款的规定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，你同意赔偿格物链科技与合作公司、关联公司，并使之免受损害。对此，格物链科技有权视你的行为性质，采取包括但不限于删除你发布信息内容、暂停使用许可、终止服务、限制使用、回收帐号、追究法律责任等措施。对恶意注册帐号或利用帐号进行违法活动、捣乱、骚扰、欺骗、其他用户以及其他违反本协议的行为，格物链科技有权回收其帐号。同时，格物链科技会视司法部门的要求，协助调查。

4、你需要对自己在服务使用过程中的行为负法律责任，即使你已经终止使用该服务。你承担法律责任的形式包括但不限于：对受到侵害者进行赔偿，以及在格物链科技首先承担了因你的行为导致的行政处罚或侵权损害赔偿责任后，你应给予格物链科技等额的赔偿。

5、格物链科技有权根据认定程序及标准判断你账户的使用可能危及你的账户安全及/或格物链科技应用信息安全的，格物链科技可拒绝提供相应服务或终止本协议。

十三、服务内容
1、你在交易过程中与其他用户发生争议的，你或其他用户中任何一方可以自行协商解决，也可以通过格物链科技介入处理，若你觉得以上的方式均无法达到你要的结果，你可以寻求司法机关的协助。

2、你选择格物链科技介入的方式处理相关问题，那么你需要遵守和执行格物链科技的处理结果。若你对格物链科技的处理结果不满意，你可以寻求其他途径解决纠纷例如起诉、仲裁等方式，但在此之前你需先履行该结果。

3、格物链科技目前为你提供免费提供服务，但格物链科技保留因业务调整或者其他法律法规要求向你收取费用的权利。

4、格物链科技网络服务的具体内容由格物链科技根据实际情况提供。

5、鉴于网络服务的特殊性，你同意格物链科技有权不经事先通知，随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。格物链科技不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。

6、终止服务

你同意格物链科技得基于其自行之考虑，因任何理由，或格物链科技认为你已经违反本服务协议的文字及精神，终止你的密码、帐号或本服务之使用（或服务之任何部分），并将你在本服务内任何内容加以移除并删除。你同意依本服务协议任何规定提供之本服务，无需进行事先通知即可中断或终止，你承认并同意，格物链科技可立即关闭或删除你的帐号及你帐号中所有相关信息及文件，及/或禁止继续使用前述文件或本服务。此外，你同意若本服务之使用被中断或终止或你的帐号及相关信息和文件被关闭或删除，格物链科技对你或任何第三人均不承担任何责任。

十四、免责声明
因以下情况造成网络服务在合理时间内的中断，格物链科技无需为此承担任何责任；

（1）格物链科技需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，格物链科技保留不经事先通知为维修保养、升级或其它目的暂停本服务任何部分的权利。

（2）因台风、地震、洪水、雷电或恐怖袭击等不可抗力原因；

（3）你的电脑软硬件和通信线路、供电线路出现故障的；

（4）因病毒、木马、恶意程序攻击、网络拥堵、系统不稳定、系统或设备故障、通讯故障、电力故障、银行原因、第三方服务瑕疵或政府行为等原因。

尽管有前款约定，格物链科技将采取合理行动积极促使服务恢复正常。

十五、知识产权和其他合法权益
1、格物链科技产品及相关网站上由格物链科技上传、制作、拥有的所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由格物链科技或其关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。但如因你上传的由其自行制作、拥有的内容涉及侵犯格物链科技或其他任何第三方的合法权益的，你应自行对其侵权行为产生的纠纷进行处理，并对其侵权行为承担法律责任，且就由此给格物链科技造成的损失（包括但不限于格物链科技声誉的影响、格物链科技由此承担的连带责任（如有）等）进行赔偿。

2、非经格物链科技或其关联公司书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表在本网站上程序或内容（仅限于由格物链科技上传、制作、拥有的所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计等）；如你需使用著作权非格物链科技所有的内容的，你应获得具体内容的著作权所有者的合法授权才能使用，如因你私自使用非自己所有的、且未经他人合法授权的著作、图片、档案、资讯、资料等内容的，由你自行承担责任，包括但不限于你自行对其侵权行为产生的纠纷进行处理，并对其侵权行为承担法律责任，且就由此给乙方造成的损失（包括但不限于乙方声誉的影响、乙方由此承担的连带责任（如有）等）进行赔偿。

3、尊重知识产权是你应尽的义务，如有违反，你应承担损害赔偿责任。

十六、 联系我们
如您对本政策有任何疑问、意见或建议，或者您在管理您的个人信息时遇到任何问题，您可通过我们提供的多种反馈渠道与我们联系：

1、您的个人信息相关咨询、投诉问题，可通过格物链科技应用客服及格物链科技应用服务中心在线客服与我们取得联系。

2、如您对本政策内容有任何疑问、意见或建议，可与请拨打我们的客服电话400-998-7255或登录格物链科技官网https://testflowy.com 或通过在线客服的方式与我们联系。

服务条款
一、服务条款
格物链科技服务条款（下称“服务条款”）是深圳格物链科技有限公司 (下称“格物链科技”)与您就格物链科技服务等相关事项所订立的有效合约。您通过盖章、网络页面点击确认或以其他方式选择接受本服务条款，即表示您与格物链科技已达成协议并同意接受本服务条款的全部约定内容。在接受本服务条款之前，请您仔细阅读本服务条款的全部内容。如果您对本服务条款的条款有疑问的，请通过询问格物链科技，格物链科技将向您解释条款内容。如果您不同意本服务条款的任意内容，或者无法准确理解格物链科技对条款的解释，请不要进行后续操作。

二、定义及解释
1、格物链科技服务：

指格物链科技向您提供的在https://testflowy.com 网站和乙方提供技术支持的其他联盟成员的相关服务和界面上所展示的格物链科技服务以及相关的技术及网络支持服务。

三、格物链科技云平台
1、服务费：

是您为购买“格物链科技服务”支付的费用，具体数额将在您订购页面予以列明公示，或者由 “格物链科技服务销售合同”约定。

2、服务费的续费：

您为在约定服务到期后持续使用“格物链科技服务”，在约定服务到期前进行服务续费。您在每次续费前有义务再次认真阅读并确保完全理解https://testflowy.com 网站下《格物链科技服务条款》的各项规定，在全部同意该条款所有内容后进行续费，您每次续费行为将视为已阅读并完全理解《格物链科技服务条款》最新版且承诺遵守约定。

四、服务内容
1、本条款中“服务”特指格物链科技服务。

2、格物链科技提供的格物链科技服务必须符合本服务条款的约定。

五、续费
1、服务期满双方愿意继续合作的，您至少应在服务期满前7天内支付续费款项，以使服务得以继续进行。如续费时格物链科技对格物链科技服务体系、名称或价格进行调整的，双方同意按照届时有效的新的服务体系、名称或价格履行，但调整前您已经支付的款项不受影响。

2、格物链科技保留在您未按照约定支付全部费用之前不向您提供服务和技术支持，或者终止服务和技术支持的权利。

六、您的权力与义务
1、您同意遵守本服务条款以及服务展示页面的相关管理规范及流程。您了解上述协议及规范等的内容可能会不时变更。如本服务条款的任何内容发生变动，格物链科技应通过提前30天在https://testflowy.com 的适当版面公告向您提示修改内容。如您不同意格物链科技对服务条款相关条款所做的修改，您有权停止使用格物链科技服务，此等情况下，格物链科技应与您进行服务费结算（如有），并且您需要自行备份业务数据。如您继续使用格物链科技服务，则视为您接受格物链科技对服务条款相关条款所做的修改。

2、您应按照格物链科技在https://testflowy.com 网站公示的提示及本服务条款的约定支付相应服务费用。

3、您承诺：

如果您使用格物链科技服务进行的经营活动需要获得国家有关部门的许可或批准的，应获得该有关的许可或批准。例如您从事新闻、出版、教育、医疗保健、药品和医疗器械等，同时您理解并认可，以上列举并不能穷尽您进行经营活动需要获得国家有关部门的许可或批准的全部类型，您应获得有关的许可或批准，并应符合国家及地方不时颁布相关法律法规之要求；

若格物链科技的服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束；

不利用格物链科技服务提供的资源和服务上传（Upload）、下载（download）、储存、发布如下信息或者内容，不为他人发布该等信息提供任何便利：①违反国家规定的政治宣传和新闻信息；②涉及国家秘密和安全的信息；③封建迷信和淫秽、色情、下流的信息或教唆犯罪的信息；④博彩有奖、赌博游戏、“私服”、“外挂”等非法互联网出版活动；⑤违反国家民族和宗教政策的信息；⑥妨碍互联网运行安全的信息；⑦侵害他人合法权益的信息和其他有损于社会秩序、社会治安、公共道德的信息或内容；⑧其他违反法律法规、部门规章或国家政策的内容。

不进行任何破坏或试图破坏网络安全的行为（包括但不限于钓鱼，黑客，网络诈骗，网站或空间中含有或涉嫌散播：病毒、木马、恶意代码，及通过虚拟服务器对其他网站、服务器进行涉嫌攻击行为如扫描、嗅探、ARP欺骗、DOS等）；

不从事其他违法、违规或违反格物链科技服务条款的行为。

如格物链科技发现您违反上述条款的约定，有权根据情况采取相应的处理措施，包括但不限于立即终止服务、中止服务或删除相应信息等。

如果第三方机构或个人对您提出质疑或投诉，格物链科技将通知您，您有责任在规定时间内进行说明并出具证明材料，如您未能提供相反证据或您逾期未能反馈的，格物链科技将采取包括但不限于立即终止服务、中止服务或删除相应信息等处理措施。

因您未及时更新联系方式或联系方式不正确而致使未能联系到您的，亦视为您逾期未能反馈。

4、您使用“格物链科技服务”进行商务活动所引起的一切法律纠纷均与格物链科技无关。

5、您对自己使用格物链科技服务过程产生的数据以及进入和管理格物链科技服务上各类产品与服务的账号、密码的完整性和保密性负责。因您维护不当或保密不当致使上述数据、口令、密码等丢失或泄漏所引起的一切损失和后果均由您自行承担。

6、如您违反本合同规定的任何条款，格物链科技有权拒绝向您提供格物链科技服务，并终止本合同。您已支付的“服务费”不予退还，同时格物链科技有进一步追究客户法律责任的权利。

七、格物链公司的权利和义务
1、格物链科技应按照合同约定提供服务,保证服务可持续运行及数据安全。
2、格物链科技已获得必要的许可和授权，有权按本合同约定为客户提供“格物链科技服务”。
3、格物链科技在客户使用格物链科技产品的服务期内在服务器上保存客户的信息，并在客户终止服务使用后永久删除。
4、格物链科技不向其他任何第三方保证和承诺客户提交的网页和信息符合注册标准，客户自行对其格物链科技服务提供的内容、产品、服务等承担全部责任。
5、格物链科技有权随时删除含有任何危害国家安全、淫秽色情、虚假、侮辱、诽谤、恐吓或骚扰、侵犯他人版权或人身权或其他合法权益等违法或有违社会公序良俗的内容。
6、格物链科技保留为维护系统升级而短暂停止服务的权利，在暂停服务之前，格物链科技将通过网站予以公告。
7、如果合同被终止（除由于违反合同协议致使合同终止之外），并且您此时有这项要求的话，格物链科技可应您要求在协议终止后的30日之内，向您提供一个关于数据信息的文件或获取文件的方法。在协议终止90天后（或根据客户要求可以提前），系统自动删除这些数据信息。
8、格物链科技可以根据中国法律法规的调整、行政执法机关的命令和社会伦理道德的变化相应调整格物链科技服务的审核标准，客户不得以类似“以前曾通过格物链科技审核”的理由要求格物链科技继续审核通过。
9、服务期限内，格物链科技将为您提供如下客户服务：
（1）格物链科技为付费用户提供7×12小时售后故障服务，并为付费用户提供有效的联系方式并保证付费用户能够联系到故障联系人。故障联系人在明确故障后及时进行反馈；
（2）格物链科技提供7*12小时的在线服务系统，解答客户在使用中的问题。
10、格物链科技承诺应严格遵守客户的数据保密义务。明确客户数据的所有权属于客户本身。

八、保密责任
1、保密资料指由一方向另一方披露的所有技术及非技术信息(包括但不限于产品资料，产品计划，价格，财务及营销规划，业务战略，客户信息，客户数据，研发，软件硬件，API应用数据接口，技术说明，设计，特殊公式，特殊算法等)。
2、本服务条款任何一方同意对获悉的对方之上述保密资料予以保密，并严格限制接触上述保密信息的员工遵守本条之保密义务。除非国家机关依法强制要求或上述保密资料已经进入公有领域外，接受保密资料的一方不得对外披露。
3、本服务条款双方明确认可各自用户信息和业务数据等是各自的重要资产及重点保密信息。本服务条款双方同意尽最大的努力保护上述保密信息等不被披露。一旦发现有上述保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。
4、本条款不因本服务条款的终止而失效。

九、违约责任
1、 本服务条款任何一方违约均须依法承担违约责任。
2、 您理解，鉴于计算机、互联网的特殊性，下述情况不属于格物链科技违约：
（1）格物链科技在进行格物链科技服务配置、维护、升级时，需要短时间中断服务；
（2）格物链科技提供的服务涉及到互联网及相关信息等服务，可能会受到Internet不稳定因素的影响。因此服务存在因上述不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机、通信网络、Internet等原因等造成您访问格物链科技服务速度下降或无法使用；
3、由于您的故意或过失导致遭受损失的，格物链科技不承担任何责任。
4、如因格物链科技原因，造成您连续72小时不能正常使用服务的，您可以终止服务，但非格物链科技控制之内的原因引起的除外。
5、如果格物链科技违反服务条款规定的义务，给您造成损失的，赔偿金的最高限额为您有关“格物链科技服务”向格物链科技首次提出赔偿主张时最近一次续费实际支付的“格物链科技服务”服务费。客户未续费的，以首次支付的“服务费”为限额。
6、在任何情况下，格物链科技对本服务条款所承担的违约赔偿责任总额不超过违约服务对应之服务费总额。

十、争议解决
1、 本合同的生效、解释、执行、管辖、争议的解决均适用中华人民共和国法律。
2、 因本合同引起的或与本合同有关的任何争议，双方可友好协商解决；协商不成，可将争议提交中国国际经济贸易仲裁委员会华南分会仲裁。

十一、服务期限与终止
1、如果你与格物链科技已经签署“格物链科技服务销售合同”，服务期限由该合同约定；如果没有，自您格物链科技服务创建成功之日起（而非您获取格物链科技的管理员登录号和密码之日起）计算，并以您所缴纳的服务费款项数额为依据确认服务期限。
2、 发生下列情形，合同提前终止：
（1）双方协商一致提前终止的；
（2）您严重违反本服务条款（包括但不限于a.您未按照协议约定履行付款义务，或b.您严重违反法律规定等），格物链科技有权提前终止服务，并不退还您已经支付的费用；
（3）您理解并充分认可，虽然格物链科技已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括但不限于DDOS）等危害网络安全事项或行为（以下统称该等行为），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，如因此终止服务的，格物链科技将按照实际提供服务月份计算（不足一个月的按一个月计）服务费，将剩余款项（如有）返还；
（4）如因格物链科技原因，造成您连续72小时不能正常使用服务的，您可以终止服务，格物链科技将按照实际提供服务月份计算（不足一个月的按一个月计）服务费，将剩余款项（如有）返还。

十二、特别声明
1、格物链科技郑重提示：为享有高效优质的服务，请您务必仔细阅读并确保完全理解https://testflowy.com、 网站下的《格物链科技服务条款》的服务条款是最新版本。您完全理解并认可明白， https://testflowy.com 有“格物链科技服务”服务的最新版本，任何人士和机构提供的文件（包括但不限于本合同）中有关“格物链科技服务”服务描述与该服务条款矛盾的，以该服务条款为准。
2、格物链科技有权以提前30天在https://testflowy.com上公布或给您发网站内通知或书面通知的方式将本服务条款的权利义务全部或者部分转移给格物链科技的关联公司。
3、如果任何条款在性质上或其他方面理应地在此协议终止时继续存在，那么应视为继续存在的条款，这些条款包括但不局限于保证条款、保密条款、知识产权条款、法律适用及争议解决条款。
`;

const Page = () => {
  return <UxPrivateInfo text={text} backTitle={i18n.返回} onBack={routers.goBack} />;
};

export default Page;
