import { UxPrivateInfo } from "solid-ux/UxPrivateInfo";
import { routers } from "../..";
import { i18n } from "../../../i18n";

/* eslint-disable */
const text = `
服务条款
一、服务条款
格物链科技服务条款（下称“服务条款”）是深圳格物链科技有限公司 (下称“格物链科技”)与您就格物链科技服务等相关事项所订立的有效合约。您通过盖章、网络页面点击确认或以其他方式选择接受本服务条款，即表示您与格物链科技已达成协议并同意接受本服务条款的全部约定内容。在接受本服务条款之前，请您仔细阅读本服务条款的全部内容。如果您对本服务条款的条款有疑问的，请通过询问格物链科技，格物链科技将向您解释条款内容。如果您不同意本服务条款的任意内容，或者无法准确理解格物链科技对条款的解释，请不要进行后续操作。

二、定义及解释
1、格物链科技服务：

指格物链科技向您提供的在https://testflowy.com网站和乙方提供技术支持的其他联盟成员的相关服务和界面上所展示的格物链科技服务以及相关的技术及网络支持服务。

三、格物链科技云平台
1、服务费：

是您为购买“格物链科技服务”支付的费用，具体数额将在您订购页面予以列明公示，或者由 “格物链科技服务销售合同”约定。

2、服务费的续费：

您为在约定服务到期后持续使用“格物链科技服务”，在约定服务到期前进行服务续费。您在每次续费前有义务再次认真阅读并确保完全理解https://testflowy.com网站下《格物链科技服务条款》的各项规定，在全部同意该条款所有内容后进行续费，您每次续费行为将视为已阅读并完全理解《格物链科技服务条款》最新版且承诺遵守约定。

四、服务内容
1、本条款中“服务”特指格物链科技服务。

2、格物链科技提供的格物链科技服务必须符合本服务条款的约定。

五、续费
1、服务期满双方愿意继续合作的，您至少应在服务期满前7天内支付续费款项，以使服务得以继续进行。如续费时格物链科技对格物链科技服务体系、名称或价格进行调整的，双方同意按照届时有效的新的服务体系、名称或价格履行，但调整前您已经支付的款项不受影响。

2、格物链科技保留在您未按照约定支付全部费用之前不向您提供服务和技术支持，或者终止服务和技术支持的权利。

六、您的权力与义务
1、您同意遵守本服务条款以及服务展示页面的相关管理规范及流程。您了解上述协议及规范等的内容可能会不时变更。如本服务条款的任何内容发生变动，格物链科技应通过提前30天在https://testflowy.com 的适当版面公告向您提示修改内容。如您不同意格物链科技对服务条款相关条款所做的修改，您有权停止使用格物链科技服务，此等情况下，格物链科技应与您进行服务费结算（如有），并且您需要自行备份业务数据。如您继续使用格物链科技服务，则视为您接受格物链科技对服务条款相关条款所做的修改。

2、您应按照格物链科技在https://testflowy.com网站公示的提示及本服务条款的约定支付相应服务费用。

3、您承诺：

如果您使用格物链科技服务进行的经营活动需要获得国家有关部门的许可或批准的，应获得该有关的许可或批准。例如您从事新闻、出版、教育、医疗保健、药品和医疗器械等，同时您理解并认可，以上列举并不能穷尽您进行经营活动需要获得国家有关部门的许可或批准的全部类型，您应获得有关的许可或批准，并应符合国家及地方不时颁布相关法律法规之要求；

若格物链科技的服务涉及第三方软件之许可使用的，您同意遵守相关的许可协议的约束；

不利用格物链科技服务提供的资源和服务上传（Upload）、下载（download）、储存、发布如下信息或者内容，不为他人发布该等信息提供任何便利：①违反国家规定的政治宣传和新闻信息；②涉及国家秘密和安全的信息；③封建迷信和淫秽、色情、下流的信息或教唆犯罪的信息；④博彩有奖、赌博游戏、“私服”、“外挂”等非法互联网出版活动；⑤违反国家民族和宗教政策的信息；⑥妨碍互联网运行安全的信息；⑦侵害他人合法权益的信息和其他有损于社会秩序、社会治安、公共道德的信息或内容；⑧其他违反法律法规、部门规章或国家政策的内容。

不进行任何破坏或试图破坏网络安全的行为（包括但不限于钓鱼，黑客，网络诈骗，网站或空间中含有或涉嫌散播：病毒、木马、恶意代码，及通过虚拟服务器对其他网站、服务器进行涉嫌攻击行为如扫描、嗅探、ARP欺骗、DOS等）；

不从事其他违法、违规或违反格物链科技服务条款的行为。

如格物链科技发现您违反上述条款的约定，有权根据情况采取相应的处理措施，包括但不限于立即终止服务、中止服务或删除相应信息等。

如果第三方机构或个人对您提出质疑或投诉，格物链科技将通知您，您有责任在规定时间内进行说明并出具证明材料，如您未能提供相反证据或您逾期未能反馈的，格物链科技将采取包括但不限于立即终止服务、中止服务或删除相应信息等处理措施。

因您未及时更新联系方式或联系方式不正确而致使未能联系到您的，亦视为您逾期未能反馈。

4、您使用“格物链科技服务”进行商务活动所引起的一切法律纠纷均与格物链科技无关。

5、您对自己使用格物链科技服务过程产生的数据以及进入和管理格物链科技服务上各类产品与服务的账号、密码的完整性和保密性负责。因您维护不当或保密不当致使上述数据、口令、密码等丢失或泄漏所引起的一切损失和后果均由您自行承担。

6、如您违反本合同规定的任何条款，格物链科技有权拒绝向您提供格物链科技服务，并终止本合同。您已支付的“服务费”不予退还，同时格物链科技有进一步追究客户法律责任的权利。

七、格物链公司的权利和义务
1、格物链科技应按照合同约定提供服务,保证服务可持续运行及数据安全。
2、格物链科技已获得必要的许可和授权，有权按本合同约定为客户提供“格物链科技服务”。
3、格物链科技在客户使用格物链科技产品的服务期内在服务器上保存客户的信息，并在客户终止服务使用后永久删除。
4、格物链科技不向其他任何第三方保证和承诺客户提交的网页和信息符合注册标准，客户自行对其格物链科技服务提供的内容、产品、服务等承担全部责任。
5、格物链科技有权随时删除含有任何危害国家安全、淫秽色情、虚假、侮辱、诽谤、恐吓或骚扰、侵犯他人版权或人身权或其他合法权益等违法或有违社会公序良俗的内容。
6、格物链科技保留为维护系统升级而短暂停止服务的权利，在暂停服务之前，格物链科技将通过网站予以公告。
7、如果合同被终止（除由于违反合同协议致使合同终止之外），并且您此时有这项要求的话，格物链科技可应您要求在协议终止后的30日之内，向您提供一个关于数据信息的文件或获取文件的方法。在协议终止90天后（或根据客户要求可以提前），系统自动删除这些数据信息。
8、格物链科技可以根据中国法律法规的调整、行政执法机关的命令和社会伦理道德的变化相应调整格物链科技服务的审核标准，客户不得以类似“以前曾通过格物链科技审核”的理由要求格物链科技继续审核通过。
9、服务期限内，格物链科技将为您提供如下客户服务：
（1）格物链科技为付费用户提供7×12小时售后故障服务，并为付费用户提供有效的联系方式并保证付费用户能够联系到故障联系人。故障联系人在明确故障后及时进行反馈；
（2）格物链科技提供7*12小时的在线服务系统，解答客户在使用中的问题。
10、格物链科技承诺应严格遵守客户的数据保密义务。明确客户数据的所有权属于客户本身。

八、保密责任
1、保密资料指由一方向另一方披露的所有技术及非技术信息(包括但不限于产品资料，产品计划，价格，财务及营销规划，业务战略，客户信息，客户数据，研发，软件硬件，API应用数据接口，技术说明，设计，特殊公式，特殊算法等)。
2、本服务条款任何一方同意对获悉的对方之上述保密资料予以保密，并严格限制接触上述保密信息的员工遵守本条之保密义务。除非国家机关依法强制要求或上述保密资料已经进入公有领域外，接受保密资料的一方不得对外披露。
3、本服务条款双方明确认可各自用户信息和业务数据等是各自的重要资产及重点保密信息。本服务条款双方同意尽最大的努力保护上述保密信息等不被披露。一旦发现有上述保密信息泄露事件，双方应合作采取一切合理措施避免或者减轻损害后果的产生。
4、本条款不因本服务条款的终止而失效。

九、违约责任
1、 本服务条款任何一方违约均须依法承担违约责任。
2、 您理解，鉴于计算机、互联网的特殊性，下述情况不属于格物链科技违约：
（1）格物链科技在进行格物链科技服务配置、维护、升级时，需要短时间中断服务；
（2）格物链科技提供的服务涉及到互联网及相关信息等服务，可能会受到Internet不稳定因素的影响。因此服务存在因上述不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机、通信网络、Internet等原因等造成您访问格物链科技服务速度下降或无法使用；
3、由于您的故意或过失导致遭受损失的，格物链科技不承担任何责任。
4、如因格物链科技原因，造成您连续72小时不能正常使用服务的，您可以终止服务，但非格物链科技控制之内的原因引起的除外。
5、如果格物链科技违反服务条款规定的义务，给您造成损失的，赔偿金的最高限额为您有关“格物链科技服务”向格物链科技首次提出赔偿主张时最近一次续费实际支付的“格物链科技服务”服务费。客户未续费的，以首次支付的“服务费”为限额。
6、在任何情况下，格物链科技对本服务条款所承担的违约赔偿责任总额不超过违约服务对应之服务费总额。

十、争议解决
1、 本合同的生效、解释、执行、管辖、争议的解决均适用中华人民共和国法律。
2、 因本合同引起的或与本合同有关的任何争议，双方可友好协商解决；协商不成，可将争议提交中国国际经济贸易仲裁委员会华南分会仲裁。

十一、服务期限与终止
1、如果你与格物链科技已经签署“格物链科技服务销售合同”，服务期限由该合同约定；如果没有，自您格物链科技服务创建成功之日起（而非您获取格物链科技的管理员登录号和密码之日起）计算，并以您所缴纳的服务费款项数额为依据确认服务期限。
2、 发生下列情形，合同提前终止：
（1）双方协商一致提前终止的；
（2）您严重违反本服务条款（包括但不限于a.您未按照协议约定履行付款义务，或b.您严重违反法律规定等），格物链科技有权提前终止服务，并不退还您已经支付的费用；
（3）您理解并充分认可，虽然格物链科技已经建立（并将根据技术的发展不断完善）必要的技术措施来防御包括计算机病毒、网络入侵和攻击破坏（包括但不限于DDOS）等危害网络安全事项或行为（以下统称该等行为），但鉴于网络安全技术的局限性、相对性以及该等行为的不可预见性，如因此终止服务的，格物链科技将按照实际提供服务月份计算（不足一个月的按一个月计）服务费，将剩余款项（如有）返还；
（4）如因格物链科技原因，造成您连续72小时不能正常使用服务的，您可以终止服务，格物链科技将按照实际提供服务月份计算（不足一个月的按一个月计）服务费，将剩余款项（如有）返还。

十二、特别声明
1、格物链科技郑重提示：为享有高效优质的服务，请您务必仔细阅读并确保完全理解https://testflowy.com 网站下的《格物链科技服务条款》， https://testflowy.com 的服务条款是最新版本。您完全理解并认可明白， https://testflowy.com 有“格物链科技服务”服务的最新版本，任何人士和机构提供的文件（包括但不限于本合同）中有关“格物链科技服务”服务描述与该服务条款矛盾的，以该服务条款为准。
2、格物链科技有权以提前30天在https://testflowy.com 上公布或给您发网站内通知或书面通知的方式将本服务条款的权利义务全部或者部分转移给格物链科技的关联公司。
3、如果任何条款在性质上或其他方面理应地在此协议终止时继续存在，那么应视为继续存在的条款，这些条款包括但不局限于保证条款、保密条款、知识产权条款、法律适用及争议解决条款。
`;

const Page = () => {
  return <UxPrivateInfo text={text} backTitle={i18n.返回} onBack={routers.goBack} />;
};

export default Page;
